doc/TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TODO</title>
<!-- 2015-03-25 Wed 17:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andreas Karlsson" />
</head>
<body>
<div id="content">
<h1 class="title">TODO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="todo TODO">TODO</span> </a></li>
<li><a href="#sec-2">2. Start report (NO)</a></li>
<li><a href="#sec-3">3. Profiling</a></li>
<li><a href="#sec-4">4. Easy solutions with omp critical</a></li>
<li><a href="#sec-5">5. Misc tests</a></li>
<li><a href="#sec-6">6. Start testing on Povel</a></li>
<li><a href="#sec-7">7. Optimizing flags / compilers</a></li>
<li><a href="#sec-8">8. MPI? (if so on R-side, or?)</a></li>
<li><a href="#sec-9">9. Instructions</a>
<ul>
<li><a href="#sec-9-1">9.1. Build &amp; compile</a></li>
<li><a href="#sec-9-2">9.2. Run valgrind from R</a>
<ul>
<li><a href="#sec-9-2-1">9.2.1. To explore and make callgrind readable:</a></li>
</ul>
</li>
<li><a href="#sec-9-3">9.3. Project instructions from PDC</a>
<ul>
<li><a href="#sec-9-3-1">9.3.1. For some application and HPC architecture of your choice:</a></li>
<li><a href="#sec-9-3-2">9.3.2. The project is not about:</a></li>
<li><a href="#sec-9-3-3">9.3.3. So:</a></li>
<li><a href="#sec-9-3-4">9.3.4. Examples:</a></li>
<li><a href="#sec-9-3-5">9.3.5. Now - during lab-afternoons</a></li>
<li><a href="#sec-9-3-6">9.3.6. After the course</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> </h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Start report (NO)</h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Profiling</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>profile R (AK)
</li>
<li>profile valgrind (NO) 
</li>
<li>Baseline profiling (AK)  
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Easy solutions with omp critical</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>omp critical -&gt; omp atomic write/update? (AK)
</li>
<li>profile again
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Misc tests</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>change from dynamic to static
</li>
<li>if keep critical consider naming them (possible speedup) (AK)
</li>
<li>what does nowait do? speedup? (NO)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Start testing on Povel</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Optimizing flags / compilers</h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> MPI? (if so on R-side, or?)</h2>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Instructions</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Build &amp; compile</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Howto install and compile the R-package:
</p>

<p>
<code>https://github.com/mclements/microsimulation</code>
</p>

<p>
<code>shell: git clone https://github.com/mclements/microsimulation.git</code>
</p>

<p>
<code>R: install.packages(“BH”)</code>
</p>

<p>
<code>R: install.packages(“Rcpp”)</code>
</p>

<p>
<code>shell: R CMD INSTALL path_to_microsimulation</code>
</p>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Run valgrind from R</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Howto run valgrind from shell:
</p>

<p>
<code>R --vanilla -d "valgrind --tool=memcheck --track-origins=yes" &lt; ~/src/ki/microsimulation/doc/RunSim.R</code>
</p>

<p>
<code>R --vanilla -d "valgrind --tool=callgrind" &lt; ~/src/ki/microsimulation/doc/RunSim.R</code>
</p>
</div>

<div id="outline-container-sec-9-2-1" class="outline-4">
<h4 id="sec-9-2-1"><span class="section-number-4">9.2.1</span> To explore and make callgrind readable:</h4>
<div class="outline-text-4" id="text-9-2-1">
<ul class="org-ul">
<li><a href="https://github.com/jrfonseca/gprof2dot">https://github.com/jrfonseca/gprof2dot</a>
<ul class="org-ul">
<li><code>gprof2dot -f callgrind &lt; callgrind.out.18739 | dot -Tpng &gt; profile.png</code>
</li>
<li><code>gprof2dot -f callgrind &lt; callgrind.out.18503 | dot -Tpdf &gt; profile.pdf</code>
</li>
</ul>
</li>

<li>kCachgrind
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Project instructions from PDC</h3>
<div class="outline-text-3" id="text-9-3">
</div><div id="outline-container-sec-9-3-1" class="outline-4">
<h4 id="sec-9-3-1"><span class="section-number-4">9.3.1</span> For some application and HPC architecture of your choice:</h4>
<div class="outline-text-4" id="text-9-3-1">
<ul class="org-ul">
<li>Develop efficient program for non-trivial problem
</li>
<li>Demonstrate and report how efficient it is.
</li>
<li>4.5 ECTS = 3 weeks of work incl. report writing
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-2" class="outline-4">
<h4 id="sec-9-3-2"><span class="section-number-4">9.3.2</span> The project is not about:</h4>
<div class="outline-text-4" id="text-9-3-2">
<ul class="org-ul">
<li>Substantial development of new code.
</li>
<li>Scientific results obtained with code
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-3" class="outline-4">
<h4 id="sec-9-3-3"><span class="section-number-4">9.3.3</span> So:</h4>
<div class="outline-text-4" id="text-9-3-3">
<ul class="org-ul">
<li>Prioritize measurements and analysis/interpretation!
</li>
<li>Demonstrate use of tools (profiling, &#x2026;) , and simple performance model.
</li>
<li>NO TIME for development of new significant code.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-4" class="outline-4">
<h4 id="sec-9-3-4"><span class="section-number-4">9.3.4</span> Examples:</h4>
<div class="outline-text-4" id="text-9-3-4">
<ul class="org-ul">
<li>Parallelize a code you know and/or work with; choose interesting part.
</li>
<li>Write a simple code for key algorithm of bigger solution process
</li>
<li>Write a simple code for a simple problem
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-5" class="outline-4">
<h4 id="sec-9-3-5"><span class="section-number-4">9.3.5</span> Now - during lab-afternoons</h4>
<div class="outline-text-4" id="text-9-3-5">
<ul class="org-ul">
<li>Discuss with instructors \&amp; course participants, form groups of size G.
</li>
<li>Define project and choose tutor: Michael, Jonathan, Erwin, Stefano
</li>
<li>Write very short synopsis, check with supervisor
</li>
<li>Submit synopsis to summer-info@pdc.kth.se before end of HPC course
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-6" class="outline-4">
<h4 id="sec-9-3-6"><span class="section-number-4">9.3.6</span> After the course</h4>
<div class="outline-text-4" id="text-9-3-6">
<ul class="org-ul">
<li>Start the work ASAP:
</li>
<li>Finish the work; Get in touch with tutor
</li>
<li>Submit report to tutor.
The report will be graded and sent back with comments; you may have to complete some parts and hand in again. We need email and paper mail address!
</li>
<li>KTH students: LADOK
</li>
<li>Other students: Certificate will be sent to you
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andreas Karlsson</p>
<p class="date">Created: 2015-03-25 Wed 17:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
